<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Wepa Print App</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.Wepa-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wepa Print App</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wepanow.com/downloads/wepa%20Print%20App.msi</string>
                <key>filename</key>
                <string>WepaPrintApp.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
