Description: Putty Download
Identifier: com.github.rustymyers.download.Putty-Win
MinimumVersion: 0.2.9

Input:
  NAME: Putty
  SEARCH_URL: https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html
  SEARCH_PATTERN: (https.*\/putty-(?P<version>[0-9].[0-9]{2,})-installer.msi)
  USER_AGENT: Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      request_headers:
        user-agent: "%USER_AGENT%"
      url: "%match%"

  - Processor: EndOfCheckPhase
