Description: Recipe description
Identifier: com.github.rustymyers.download.Git-Win
Input:
  NAME: Git-Win
MinimumVersion: '2.3'

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: git-for-windows/git
      asset_regex: 'Git-(?P<version_exe>([0-9]{1,3}.){2,4}[0-9])-64-bit.exe'

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version_exe%.exe"