Description: Downloads the latest version of LoginLog from twocanoes BitBucket.
Identifier: com.github.rustymyers.download.LoginLog
MinimumVersion: 1.0.0

Input:
  NAME: LoginLog
  APP_FILENAME: LoginLog
  DOWNLOAD_URL: https://bitbucket.org/twocanoes/loginlog/downloads/
  DOWNLOAD_PATTERN: (\/twocanoes\/loginlog\/downloads\/PreBeta-LoginLog_Build-[0-9]{4}_Version-([0-9]{0,5}.{0,3}).dmg)

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%DOWNLOAD_PATTERN%'
    url: '%DOWNLOAD_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://bitbucket.org%match%

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/LoginLog.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString

- Processor: EndOfCheckPhase
