Description: Downloads Full Archive from Allsight
Identifier: edu.psu.download.AllsightArchive
MinimumVersion: 0.2.0

Input:
  NAME: AllsightArchive
  SEARCH_URL: https://www.sassafras.com/downloads/

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "v[0-9]{1,3}.dmg"
      url: "%SEARCH_URL%"
  - Processor: URLDownloader
    Arguments:
      url: "https://www.sassafras.com/software/release/%match%"
      filename: "%NAME%.dmg"
