<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Box Drive.</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.boxdrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Box Drive</string>
        <key>JSON_URL</key>
        <string>https://cdn07.boxcdn.net/Autoupdate.json</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is now non-functional. Please remove it from your list of recipes.</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>com.github.rustymyers.SharedProcessors/BoxDriveDownloadURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>os_type</key>
                <string>mac</string>
                <key>release</key>
                <string>enterprise</string>
                <key>url_type</key>
                <string>rollout-url</string>
            </dict>
        </dict>
		<dict>
	        <key>Processor</key>
	        <string>URLDownloader</string>
	        <key>Arguments</key>
	        <dict>
	            <key>url</key>
	            <string>%url%</string>
	            <key>request_headers</key>
	            <dict>
	                    <key>user-agent</key>
	                    <string>%USER_AGENT%</string>
	            </dict>
	        </dict>		
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
