<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Box Drive for Windows.</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.boxdrivewin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BoxNotes</string>
        <key>JSON_URL</key>
        <string>https://cdn07.boxcdn.net/Autoupdate.json</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%JSON_URL%</string>
                <key>re_pattern</key>
<!--\s"win"\s*:\s*(.+?)\s*,\s*"enterprise":\s*(.+?)\s*"version": "([0-9]{1,2}.[0-9]{1,2}.[0-9]{1,3})",\s*"download-url"\s*:\s*(.+?)\s*(P&lt;DOWNLOAD_URL&gt;https.[a-z,0-9,A-Z,/,.]{1,}) -->
<string>"win"\s*:\s*(.+?)\s*,\s*"enterprise":\s*(.+?)\s*"version": "(?P&lt;version&gt;[0-9]{1,2}.[0-9]{1,2}.[0-9]{1,3})",\s*"download-url"\s*:\s*(.+?)\s*(?P&lt;DOWNLOAD_URL&gt;https.[a-z,0-9,A-Z,/,.]{1,})</string>
<!-- \s"win"\s*:\s*(.+?)\s*,\s*"enterprise":\s*(.+?)\s*"version": "([0-9]{1,2}.[0-9]{1,2}.[0-9]{1,3})",\s*"download-url"\s*:\s*(.+?)\s*(https.[a-z,0-9,A-Z,/,.]{1,}) -->
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.msi</string>
            </dict>
        </dict>
        <!-- <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/BOXDRIVE/</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/BOXDRIVE/BoxDesktopDrive.pkg/Payload</string>
                <key>extract_root</key>
                <string>%RECIPE_CACHE_DIR%/BOXDRIVE/</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/BOXDRIVE/Box.app/Contents/Info.plist</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>

        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
				<array>
				    <string>%RECIPE_CACHE_DIR%/BOXDRIVE</string>
				</array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
