<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Box Notes.</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.boxnotes</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BoxNotes</string>
        <key>DOWNLOAD_URL</key>
        <string>https://e3.boxcdn.net/box-installers/boxnotes/mac/latest/Box%20Notes.zip</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mikestechshop.download.BoxNotes</string>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is being removed as duplicate. Please remove it from your list of recipes and use com.github.mikestechshop.download.BoxNotes.</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
