<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest EnergyPlus.</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.EnergyPlus</string>
    <!-- Defaults to x86_64, pass arm64 to ARCH for Apple Silicon or arm for Linux -->
    <!-- OS can be Windows, macOS, Ubuntu, CentOS -->
    <!-- osVersion should be nothing for Windows, (10/11/12) for macOS  and linux version  for each distro -->
    <!-- EXT can be (zip/exe) for Windows, (dmg/tar.gz) for macOS and (run/sh/tar.gz) for linux -->
    <key>Input</key>
    <dict>
        <key>ARCH</key>
        <string>x86_64</string>
        <key>OS</key>
        <string>macOS</string>
        <key>OSVersion</key>
        <string>12</string>
        <key>EXT</key>
        <string>dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>.*%ARCH%.dmg</string>
                <key>github_repo</key>
                <string>NREL/EnergyPlus</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
