<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest EnergyPlus dmg.</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.EnergyPlus</string>
    <!-- Defaults to x86_64, pass arm64 to ARCH for Apple Silicon or arm for Linux -->
    <!-- OS can be Windows, macOS, Ubuntu, CentOS -->
    <!-- osVersion should be nothing for Windows, (10/11/12) for macOS  and linux version  for each distro -->
    <!-- EXT can be (zip/exe) for Windows, (dmg/tar.gz) for macOS and (run/sh/tar.gz) for linux -->
    <key>Input</key>
    <dict>
        <key>ARCH</key>
        <string>x86_64</string>
        <key>OS</key>
        <string>macOS</string>
        <key>OSVersion</key>
        <string>12</string>
        <key>EXT</key>
        <string>dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>NREL/EnergyPlus</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>com.github.jgstew.SharedProcessors/SharedUtilityMethods</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>com.github.jgstew.SharedProcessors/FileTextSearcher</string>
          <key>Arguments</key>
          <dict>
              <key>search_path</key>
              <string>%pathname%</string>
              <key>search_pattern</key>
              <string>https:\/\/.*%OS%%OSVersion%.*%ARCH%\.*%EXT%</string>
              <key>first_result_only</key>
              <string>True</string>
              <key>file_search_results_var</key>
              <string>download_url</string>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%download_url%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>