<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest Pidgin with GTK exe. Permission was obtained from FossHub to automate the download of this software. Please follow their terms of service: https://www.fosshub.com/tos.html</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.PidginGTK-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Pidgin</string>
        <key>SEARCH_URL</key>
        <string>https://www.fosshub.com/Pidgin.html</string>
        <key>SEARCH_PATTERN</key>
        <string>\/Pidgin.html.(pidgin-([0-9]{1,}.[0-9]{1,}.[0-9]{1,})-offline.exe)</string>
        <key>SEARCH_PATTERN2</key>
        <string>(https.*-offline.exe)</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.fosshub.com/Pidgin.html</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.fosshub.com/Pidgin.html/%match%-offline.exe</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN2%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                 <key>request_headers</key>
                    <dict>
                            <key>user-agent</key>
                            <string>%USER_AGENT%</string>
                    </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
