<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest Pidgin with GTK exe. Permission was obtained from FossHub to automate the download of this software. Please follow their terms of service: https://www.fosshub.com/tos.html</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.PidginGTK-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Pidgin</string>
        <key>SEARCH_URL</key>
        <string>https://www.fosshub.com/Pidgin.html</string>
        <key>SEARCH_PATTERN</key>
        <string>\/Pidgin.html.(pidgin-([0-9]{1,}.[0-9]{1,}.[0-9]{1,})-offline.exe)</string>
        <key>SEARCH_PATTERN2</key>
        <string>(https.*-offline.exe)</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.fosshub.com/Pidgin.html</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.fosshub.com/Pidgin.html/%match%-offline.exe</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN2%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                 <key>request_headers</key>
                    <dict>
                            <key>user-agent</key>
                            <string>%USER_AGENT%</string>
                            <key>Referer</key>
                            <string>https://www.fosshub.com/Pidgin.html</string>
                    </dict>
            </dict>
        </dict>
		<dict>
		            <key>Processor</key>
		            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
		            <key>Arguments</key>
		            <dict>
		                <key>exe_path</key>
		                <string>%pathname%</string>
		                <key>extract_dir</key>
		                <string>ExeExtract</string>
		            </dict>
		        </dict>
		        <dict>
		            <key>Processor</key>
		            <string>com.github.hansen-m.SharedProcessors/BESRelevanceProvider</string>
		            <key>Arguments</key>
		            <dict>
		                <key>bes_filepath</key>
		                <string>%pathname%</string>
		                <key>output_var_name</key>
		                <string>version</string>
		                <key>bes_relevance</key>
		                <string>following text of first "Version=" of line whose (it starts with "Version=") of file "%RECIPE_CACHE_DIR%/ExeExtract/core/application.ini"</string>
		            </dict>
		        </dict>
		        <dict>
		            <key>Processor</key>
		            <string>PathDeleter</string>
		            <key>Arguments</key>
		            <dict>
		                <key>path_list</key>
		                <array>
		                    <string>%RECIPE_CACHE_DIR%/ExeExtract</string>
		                </array>
		            </dict>
		        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
