<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>TextPad is a powerful, general purpose editor for plain text files. Easy to use, with all the features a power user requires.</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.TextPad-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TextPad</string>
        <key>SEARCH_URL</key>
        <string>https://www.textpad.com/download/index.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(\/download.*\/txpeng.*32.zip)</string>
        <key>SEARCH_PATTERN2</key>
        <string>&gt;([0-9]{1,}.[0-9]{1,}.[0-9]{1,})</string>
        <key>USER_AGENT</key>
        <string>Mozilla/4.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN2%</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.textpad.com/%match%</string>
                <key>request_headers</key>
                    <dict>
                            <key>user-agent</key>
                            <string>%USER_AGENT%</string>
                    </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
