Description: |
  Downloads the current release version of Audacity via the project
  website. The downloads redirect to a fosshub.com download page, which
  is also searched for a download link. Permission has been received for Penn State to automate the download.
  Note: the Audacity.app code object is not signed at all."
Identifier: com.github.rustymyers.download.Audacity-Win
MinimumVersion: 0.2.9

Input:
  NAME: Audacity-Win
  SEARCH_URL: https://www.audacityteam.org/download/windows/
  SEARCH_PATTERN: (https:\/\/.*Audacity-(?P<version>[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,4})/.*-64bit.exe)
  USER_AGENT: Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: audacity/audacity
      asset_regex: ".*audacity-win-(?P<version>[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,4})-64bit.exe"

  - Processor: URLDownloader
    Arguments:
      request_headers:
        user-agent: "%USER_AGENT%"
      url: "%url%"
