<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>!Deprecated! Downloads the current release version of Audacity via the project
website. The downloads redirect to a fosshub.com download page, which
is also searched for a download link. Permission has been received for Penn State to automate the download.
Note: the Audacity.app code object is not signed at all.</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.Audacity</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Audacity</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Audacity recipe no longer maintained. Switching to using: com.github.ahousseini-recipes.pkg.Audacity</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
    </array>
</dict>
</plist>
