<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Tenable Nessus Red Hat ES 8 (64-bit) / CentOS 8 / Oracle Linux 8 (including Unbreakable Enterprise Kernel).</string>
        <key>Identifier</key>
        <string>com.github.rustymyers.autopkg.download.Nessus-RedHat64</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Nessus</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
           <dict>
              <key>Processor</key>
              <string>URLTextSearcher</string>
              <key>Arguments</key>
              <dict>
                  <key>url</key>
                  <string>https://www.tenable.com/downloads/nessus-agents</string>
                  <key>result_output_var_name</key>
                  <string>download_id</string>
                  <key>re_pattern</key>
                  <string>"id":([\d]*)(?=,"file":"NessusAgent-[\d\.]*-es[0-9]{1,4}.x86_64.rpm)</string>
              </dict>
            </dict>
           <dict>
              <key>Processor</key>
              <string>URLTextSearcher</string>
              <key>Arguments</key>
              <dict>
                  <key>url</key>
                  <string>https://www.tenable.com/downloads/nessus-agents</string>
                  <key>result_output_var_name</key>
                  <string>version</string>
                  <key>re_pattern</key>
                  <string>NessusAgent-([\d\.]*)*-es[0-9]{1,4}.x86_64.rpm</string>
              </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.tenable.com/downloads/api/v1/public/pages/nessus-agents/downloads/%download_id%/download?i_agree_to_tenable_license_agreement=true</string>
                    <key>CHECK_FILESIZE_ONLY</key>
                    <true />
                    <key>filename</key>
                    <string>%NAME%-%version%-RedHat64.deb</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
