Description: Download recipe for Tenable Nessus Ubuntu 14.04, 16.04, 18.04, 20.04 AMD64.
Identifier: com.github.rustymyers.autopkg.download.Nessus-Ubuntu
MinimumVersion: 0.5.0

Input:
  NAME: Nessus

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '"id":([\d]*)(?=,"file":"NessusAgent-[\d\.]*.{1,4}-ubuntu[0-9]{1,4}_amd64.deb)'
    result_output_var_name: download_id
    url: https://www.tenable.com/downloads/nessus-agents

- Processor: URLTextSearcher
  Arguments:
    re_pattern: NessusAgent-([\d\.]*).ubuntu[0-9]{1,5}_amd64.deb
    result_output_var_name: version
    url: https://www.tenable.com/downloads/nessus-agents?loginAttempted=true

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: true
    filename: '%NAME%-%version%-Ubuntu64.deb'
    url: https://www.tenable.com/downloads/api/v1/public/pages/nessus-agents/downloads/%download_id%/download?i_agree_to_tenable_license_agreement=true

- Processor: EndOfCheckPhase
