Description: Download recipe for Tenable Nessus Red Hat ES 8 (64-bit) / CentOS 8 / Oracle Linux 8 (including Unbreakable Enterprise Kernel).
Identifier: com.github.rustymyers.autopkg.download.Nessus-RedHat8
MinimumVersion: 0.5.0

Input:
  NAME: Nessus

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"id":([\d]*)(?=,"file":"NessusAgent-[\d\.]*-el8.x86_64.rpm)'
      result_output_var_name: download_id
      url: https://www.tenable.com/downloads/nessus-agents

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: NessusAgent-([0-9]{1,4}.{1,4}.[0-9]{1,4})-el[0-9]{1,4}.x86_64.rpm
      result_output_var_name: version
      url: https://www.tenable.com/downloads/nessus-agents?loginAttempted=true

  - Processor: URLDownloader
    Arguments:
      CHECK_FILESIZE_ONLY: true
      filename: "%NAME%-%version%-RedHat64.rpm"
      url: https://www.tenable.com/downloads/api/v1/public/pages/nessus-agents/downloads/%download_id%/download?i_agree_to_tenable_license_agreement=true

  - Processor: EndOfCheckPhase
