Description: Download recipe for Tenable Nessus Windows Server 2008 SP2, Server 2008 R2 SP1, Server 2012, Server 2012 R2, Server 2016, Server 2019, 7, 8.1, and 10 (64-bit).
Identifier: com.github.rustymyers.autopkg.download.Nessus-Win
MinimumVersion: 0.5.0

Input:
  NAME: Nessus

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '"id":([\d]*)(?=,"file":"NessusAgent-[\d\.]*\-x64.msi)'
    result_output_var_name: download_id
    url: https://www.tenable.com/downloads/nessus-agents

- Processor: URLTextSearcher
  Arguments:
    re_pattern: NessusAgent-([\d\.]*)\-x64.msi
    result_output_var_name: version
    url: https://www.tenable.com/downloads/nessus-agents?loginAttempted=true

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: true
    filename: '%NAME%-%version%.msi'
    url: https://www.tenable.com/downloads/api/v1/public/pages/nessus-agents/downloads/%download_id%/download?i_agree_to_tenable_license_agreement=true

- Processor: EndOfCheckPhase
