<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads KompoZer</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.kompozer</string>
    <key>Input</key>
    <dict>
        <key>SOURCEFORGE_FILE_PATTERN</key>
    	<string>kompozer.*mac-universal.dmg</string>
    	<key>SOURCEFORGE_PROJECT_ID</key>
    	<string>170132</string>
    	<key>NAME</key>
		<string>KompoZer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Processor</key>
			<string>SourceForgeURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
