<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Wacom Tablet drivers for Windows.</string>
	<key>Identifier</key>
	<string>com.github.rustymyers.download.WacomTablet-Win</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_PATTERN</key>
		<string>(?P&lt;url&gt;(https:\/\/cdn\.wacom\.com\/u\/productsupport\/drivers\/win\/professional\/WacomTablet_+(?P&lt;version&gt;[\d.-]+)\.exe))</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.wacom.com/en-us/support/product-support/drivers</string>
		<key>NAME</key>
		<string>Wacom Bamboo Driver Windows</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>WacomTablet-Win.exe</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>