<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Wacom Bamboo tablet drivers for Windows.</string>
	<key>Identifier</key>
	<string>com.github.rustymyers.download.WacomBamboo-Win</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_PATTERN</key>
		<string>(http://cdn.wacom.com/u/productsupport/drivers/win/consumer/pentablet_+(?P&lt;version&gt;[0-9].+[0-9].+[0-9]*-*[0-9]).exe)</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.wacom.com/en-us/support/product-support/drivers</string>
		<key>NAME</key>
		<string>Wacom Bamboo Driver</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Bamboo downloads no longer availiable from Wacom. See WacomTablet-Win.download.recipe</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
	</array>
</dict>
</plist>