Description: Downloads the latest version of Wacom Intuos and Cintiq tablet drivers for Windows.
Identifier: com.github.rustymyers.download.WacomIntuos-Win
MinimumVersion: '1.1'

Input:
  NAME: Wacom Intuos Driver Windows
  DOWNLOAD_PATTERN: (http://cdn.wacom.com/u/productsupport/drivers/win/professional/WacomTablet_+(?P<version>[0-9].+[0-9].+[0-9]*-*[0-9]).exe)
  DOWNLOAD_URL: https://www.wacom.com/en-us/support/product-support/drivers

Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: Intuos downloads no longer availiable from Wacom. See WacomTablet-Win.download.recipe
