<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest Synfig dmg. Permission was obtained from FossHub to automate the download of this software. Please follow their terms of service: https://www.fosshub.com/tos.html</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.Synfig</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Synfig</string>
        <key>SEARCH_URL</key>
        <string>http://www.fosshub.com/Synfig.html</string>
        <key>SEARCH_PATTERN</key>
        <string>\/Synfig.html.(synfigstudio-([0-9].[0-9].[0-9]))\.dmg</string>
        <key>SEARCH_PATTERN2</key>
        <string>(https.*\.dmg)</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.rustymyers.SharedProcessors/FossHubURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>app_name</key>
                <string>Synfig</string>
                <key>app_type</key>
                <string>OS X Binary</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                 <key>request_headers</key>
                    <dict>
                            <key>user-agent</key>
                            <string>%USER_AGENT%</string>
                            <key>Referer</key>
                            <string>https://www.fosshub.com/Synfig.html</string>
                    </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
