<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GitHub Desktop.</string>
	<key>Identifier</key>
	<string>com.github.rustymyers.download.GitHubDesktop-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GitHub Desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>GitHubDesktop.msi</string>
				<key>url</key>
				<string>https://central.github.com/deployments/desktop/desktop/latest/win32?format=msi</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/MSIInfoVersionProvider</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
