Comment: Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Veusz.
Identifier: com.github.rustymyers.download.Veusz-Win
MinimumVersion: 0.6.1

Input:
  NAME: Veusz

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*exe
    github_repo: veusz/veusz

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.exe'

- Processor: EndOfCheckPhase
