<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.rustymyers.download.VineServer</string>
	<key>Input</key>
	<dict>
        <key>BIGFIXNAME</key>
        <string>VineServer</string>
        <key>NAME</key>
        <string>Vine Server</string>
    	<key>Description</key>
    	<string>Downloads the latest version of Vine Server.</string>
        <key>SEARCH_PATTERN</key>
        <string>http.*VineServer[0-9].[0-9][0-9]\.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.testplant.com/dlds/vine/</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
				<key>filename</key>
				<string>%BIGFIXNAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
                <key>input_plist_path</key>
                <string>%pathname%/%NAME%.app/Contents/Info.plist</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
