<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest QnA.app.</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.QnA</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>QnA</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
    <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://support.bigfix.com/install/besclients-nonwindows.html</string>
                <key>re_pattern</key>
                <string>Mac OS&lt;/h2&gt;\n&lt;b&gt;(?P&lt;version&gt;[0-9].?[0-9].?[0-9].?.?.[0-9])</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://support.bigfix.com/install/besclients-nonwindows.html</string>
                <key>re_pattern</key>
                <string>a href=.?(?P&lt;url&gt;http.*?%version%.*?\.dmg).*utilities</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>