Description: Downloads GeoDa for macOS
Identifier: com.github.rustymyers.download.GeoDa
MinimumVersion: 0.2.9

Input:
  NAME: GeoDa
  RELEASE_REGEX: .*-x86_64-[iI]nstaller.dmg

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: GeoDaCenter/geoda
      asset_regex: "%RELEASE_REGEX%"

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.dmg"
  - Processor: EndOfCheckPhase
