Description: Downloads GeoDa 64 bit exe.
Identifier: com.github.rustymyers.download.GeoDa-Win64
MinimumVersion: 0.2.9

Input:
  NAME: GeoDa
  RELEASE_REGEX: .*-x64-installer.zip

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: GeoDaCenter/geoda
      asset_regex: "%RELEASE_REGEX%"

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.zip"
  - Processor: EndOfCheckPhase
