<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Solstice for USB drives.</string>
	<key>Identifier</key>
	<string>com.github.rustymyers.download.SolsticeUSB</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>SolsticeClientMacWeb</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.mersive.com/download/</string>
		<key>NAME</key>
		<string>Solstice</string>
		<key>DOWNLOAD_PATTERN</key>
		<string>((www.mersive.com\/downloads\/SolsticeClientMac-([0-9]{0,5}.){0,3})tgz)</string>
<!--www.mersive.com\/downloads\/SolsticeClientMac-+([0-9].){0,5}tgz -->
<!--http://www.mersive.com/downloads/SolsticeClientMac-3.4.11107.tgz -->
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
        <!-- <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict> -->
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%DOWNLOAD_PATTERN%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.tar</string>
                <key>url</key>
                <string>https://%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_format</key>
                <string>tar_gzip</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/usb_Mersive Solstice.app</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Solstice Client.app</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Solstice Client.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Solstice Client.app</string>
                <key>requirement</key>
                <string>identifier "com.mersive.solstice.client" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "63B5A5WDNG"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <!-- <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
