Description: Recipe description
Identifier: com.github.rustymyers.download.MSdotNetFramework-Win
MinimumVersion: '1.0'

Input:
  NAME: .Net Framework Win

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: download\/dotnet/(\d{1,3}.\d{1,3})
    result_output_var_name: version
    url: https://dotnet.microsoft.com/download/dotnet-core

- Processor: URLTextSearcher
  Arguments:
    re_pattern: sdk-(\d{1,3}\.\d{1,3}\.\d{1,5})
    result_output_var_name: long_version
    url: https://dotnet.microsoft.com/download/dotnet/%version%

- Processor: URLTextSearcher
  Arguments:
    re_pattern: sdk-%long_version%-windows-x64-binaries
    result_output_var_name: match
    url: https://dotnet.microsoft.com/download/dotnet/%version%

- Processor: URLTextSearcher
  Arguments:
    re_pattern: https.*dotnet-sdk-%long_version%-win-x64.zip
    url: https://dotnet.microsoft.com/download/dotnet/thank-you/%match%

- Processor: URLDownloader
  Arguments:
    url: '%match%'

- Processor: EndOfCheckPhase
