<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe description</string>
	<key>Identifier</key>
	<string>com.github.rustymyers.download.MSdotNetFramework-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>.Net Framework</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://dotnet.microsoft.com/download/dotnet-core</string>
				<key>re_pattern</key>
				<string><![CDATA[download\/dotnet/(\d{1,3}.\d{1,3})]]></string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://dotnet.microsoft.com/download/dotnet/%version%</string>
				<key>re_pattern</key>
				<string><![CDATA[sdk-(\d{1,3}\.\d{1,3}\.\d{1,5})]]></string>
				<key>result_output_var_name</key>
				<string>long_version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://dotnet.microsoft.com/download/dotnet/%version%</string>
				<key>re_pattern</key>
				<string><![CDATA[sdk-%long_version%-windows-x64-binaries]]></string>
				<key>result_output_var_name</key>
				<string>match</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://dotnet.microsoft.com/download/dotnet/thank-you/%match%</string>
				<key>re_pattern</key>
				<string><![CDATA[https.*dotnet-sdk-%long_version%-win-x64.zip]]></string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
