Description: Recipe description
Identifier: com.github.rustymyers.download.MSdotNetFramework
MinimumVersion: '1.0'

Input:
  NAME: .Net Framework

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: download\/dotnet/(\d{1,3}.\d{1,3})
    result_output_var_name: version
    url: https://dotnet.microsoft.com/download/dotnet-core

- Processor: URLTextSearcher
  Arguments:
    re_pattern: sdk-(\d{1,3}\.\d{1,3}\.\d{1,5})
    result_output_var_name: long_version
    url: https://dotnet.microsoft.com/download/dotnet/%version%

- Processor: URLTextSearcher
  Arguments:
    re_pattern: sdk-%long_version%-macos-x64-installer
    result_output_var_name: match
    url: https://dotnet.microsoft.com/download/dotnet/%version%

- Processor: URLTextSearcher
  Arguments:
    re_pattern: https.*dotnet-sdk-\d{1,3}.\d{1,3}.\d{1,5}-osx-x64.pkg
    url: https://dotnet.microsoft.com/download/dotnet/thank-you/%match%

- Processor: URLDownloader
  Arguments:
    url: '%match%'

- Processor: EndOfCheckPhase
