<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Microsoft Teams dmg from Microsoft. Environment can be defined (although production seems to be the only available), as can platform (defaults to osx).</string>
    <key>Identifier</key>
    <string>com.github.rustymyers.download.MSTeams-Win</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSTeams-Win</string>
        <key>MSTEAMS_ENVIRONMENT</key>
        <string>production</string>
        <key>MSTEAMS_PLATFORM</key>
        <string>windows</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.apettinen.SharedProcessors/MSTeamsURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>environment</key>
                <string>%MSTEAMS_ENVIRONMENT%</string>
                <key>platform</key>
                <string>%MSTEAMS_PLATFORM%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>curl_opts</key>
                <array>
                    <string>--no-alpn</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <!-- <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%</string>
              <key>expected_authority_names</key>
              <array>
                 <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                 <string>Developer ID Certification Authority</string>
                 <string>Apple Root CA</string>
              </array>
           </dict>
        </dict> -->
    </array>
</dict>
</plist>
