Description: This recipe downloads Ditto Connect for macOS
Identifier: com.github.rustymyers.download.DittoConnect
MinimumVersion: "2.7.2"

Input:
  NAME: Ditto Connect
  RE_FLAGS: IGNORECASE
  SEARCH_URL: https://www.airsquirrels.com/ditto/download
  SEARCH_PATTERN: "(?<=Ditto Connect for Mac).*[\n]{1,2}.*Version (([0-9]{1,3}.){1,3}.[0-9]{1,3})"
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: "%SEARCH_URL%"
      re_pattern: "%SEARCH_PATTERN%"
