Description: Downloads Dedoose for macOS
Identifier: com.github.rustymyers.download.Dedoose
MinimumVersion: 0.2.9
# Regex Testing https://regex101.com/r/TSk9hK/1
Input:
  NAME: Dedoose
  SEARCH_URL: https://www.dedoose.com/resources/articledetail/dedoose-desktop-app
  SEARCH_PATTERN: (?P<url_match>https:\/\/downloads.*Dedoose-Mac.dmg)
  VERSION_URL: https://www.dedoose.com/resources/release-features
  VERSION_SEARCH_PATTERN: (Dedoose (?P<version>[\d|\.]{3,}))

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%VERSION_SEARCH_PATTERN%'
      url: '%VERSION_URL%'
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      request_headers:
        user-agent: "%USER_AGENT%"
      url: "%url_match%"
      filename: '%NAME%-Mac-%version%.dmg'

  - Processor: EndOfCheckPhase
