Description: Downloads Dedoose for macOS
Identifier: com.github.rustymyers.download.Dedoose
MinimumVersion: 0.2.9

Input:
  NAME: Dedoose
  SEARCH_URL: https://www.dedoose.com/resources/articledetail/dedoose-desktop-app
  SEARCH_PATTERN: (?P<url_match>https:\/\/downloads.*Dedoose-(?P<version>[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}).dmg)"

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      request_headers:
        user-agent: "%USER_AGENT%"
      url: "https:%url_match%"

  - Processor: EndOfCheckPhase
