<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of VASSAL.</string>
	<key>Identifier</key>
	<string>com.github.rustymyers.download.VASSAL-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VASSAL</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>SOURCEFORGE_FILE_PATTERN</key>
				<string>\.exe</string>
				<key>SOURCEFORGE_PROJECT_ID</key>
				<integer>90612</integer>
			</dict>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
